planmarks/2FAK/Firmware/Non-Resident CTAP2.0-2.1/targets/stm32l432/src/device.c
// Copyright 2019 SoloKeys Developers
//
// Licensed under the Apache License, Version 2.0, <LICENSE-APACHE or
// http://apache.org/licenses/LICENSE-2.0> or the MIT license <LICENSE-MIT or
// http://opensource.org/licenses/MIT>, at your option. This file may not be
// copied, modified, or distributed except according to those terms.
#include "device.h"
#include "usbd_def.h"
#include "stm32l4xx.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_tim.h"
#include "stm32l4xx_ll_usart.h"
#include "stm32l4xx_ll_pwr.h"
#include "usbd_hid.h"

#include APP_CONFIG
#include "flash.h"
#include "rng.h"
#include "led.h"
#include "device.h"
#include "util.h"
#include "fifo.h"
#include "log.h"
#include "ctaphid.h"
#include "ctap.h"
#include "crypto.h"
#include "memory_layout.h"
#include "stm32l4xx_ll_iwdg.h"
#include "usbd_cdc_if.h"
#include "nfc.h"
#include "init.h"
#include "atecc.h"
#include "sense.h"
#include "gpio.h"
#include "bsp.h"

#define LOW_FREQUENCY        1
#define HIGH_FREQUENCY       0

#define SOLO_FLAG_LOCKED                    0x2

void wait_for_usb_tether(void);

#define IS_BUTTON_PRESSED()     (button_get_press() == 1)

volatile uint32_t __90_ms = 0;
uint32_t __last_button_press_time = 0;
uint32_t __last_button_bounce_time = 0;
uint32_t __device_status = 0;
uint32_t __last_update = 0;
extern PCD_HandleTypeDef hpcd;
static int _NFC_status = 0;
static bool isLowFreq = 0;
static bool _up_disabled = false;

// #define IS_BUTTON_PRESSED()         (0  == (LL_GPIO_ReadInputPort(SOLO_BUTTON_PORT) & SOLO_BUTTON_PIN))
static int is_physical_button_pressed(void)
{
    return (0  == (LL_GPIO_ReadInputPort(SOLO_BUTTON_PORT) & SOLO_BUTTON_PIN));
}

static int is_touch_button_pressed(void)
{
    int is_pressed = (tsc_read_button(0) || tsc_read_button(1));
#ifndef IS_BOOTLOADER
    if (is_pressed)
    {
        // delay for debounce, and longer than polling timer period.
        delay(95);
        return (tsc_read_button(0) || tsc_read_button(1));
    }
#endif
    return is_pressed;
}

int (*IS_BUTTON_PRESSED)() = is_physical_button_pressed;

static void edge_detect_touch_button(void)
{
    static uint8_t last_touch = 0;
    uint8_t current_touch = 0;
    if (is_touch_button_pressed == IS_BUTTON_PRESSED)
    {
        current_touch = (tsc_read_button(0) || tsc_read_button(1));

        // 1 sample per 25 ms
        if ((millis() - __last_button_bounce_time) > 25)
        {
            // Detect "touch / rising edge"
            if (!last_touch && current_touch)
            {
                __last_button_press_time = millis();
            }
            __last_button_bounce_time = millis();
            last_touch = current_touch;
        }
    }

}

void device_disable_up(bool disable)
{
    _up_disabled = disable;
}

void run_drivers(){
#ifndef IS_BOOTLOADER
    button_manager();
    led_blink_manager();
#endif
}

// Timer6 overflow handler.  happens every ~90ms.
void TIM6_DAC_IRQHandler(void)
{
    // timer is only 16 bits, so roll it over here
    TIM6->SR = 0;
    __90_ms += 1;

    if ((millis() - __last_update) > 90 ){
        if (__device_status != CTAPHID_STATUS_IDLE){
            ctaphid_update_status(__device_status);
            __disable_irq();
            __last_update = millis();
            __enable_irq();
        }
    }

    edge_detect_touch_button();
#ifndef IS_BOOTLOADER
	// NFC sending WTX if needs
	if (device_is_nfc() == NFC_IS_ACTIVE)
	{
		WTX_timer_exec();
	}
#endif
}

// Interrupt on rising edge of button (button released)
void EXTI0_IRQHandler(void)
{
    EXTI->PR1 = EXTI->PR1;
    if (is_physical_button_pressed == IS_BUTTON_PRESSED)
    {
        // Only allow 1 press per 25 ms.
        if ((millis() - __last_button_bounce_time) > 25)
        {
            __last_button_press_time = millis();
        }
        __last_button_bounce_time = millis();
    }
}

// Global USB interrupt handler
void USB_IRQHandler(void)
{
  HAL_PCD_IRQHandler(&hpcd);
}

uint32_t millis(void)
{
    return (((volatile uint32_t)TIM6->CNT) + (__90_ms * 90));
}

void device_set_status(uint32_t status)
{
    printf1(TAG_CTAP, "Set device %s\r\n", (status==1)?"UPNEEDED":(status==0)?"IDLE":"PROCESSING");
    __disable_irq();
    __last_update = millis();
    __enable_irq();

    if (status != CTAPHID_STATUS_IDLE && __device_status != status)
    {
        ctaphid_update_status(status);
    }
    __device_status = status;
}

int device_is_button_pressed(void)
{
#ifndef IS_BOOTLOADER
    return IS_BUTTON_PRESSED();
#else // bootloader only
    return IS_BUTTON_PRESSED_RAW();
#endif
}

void delay(uint32_t ms)
{
    uint32_t time = millis();
    while ((millis() - time) < ms)
        run_drivers();
}

void device_reboot(void)
{
    NVIC_SystemReset();
}

void device_init_button(void)
{
    if (tsc_sensor_exists())
    {
        tsc_init();
        IS_BUTTON_PRESSED = is_touch_button_pressed;
    }
    else
    {
        IS_BUTTON_PRESSED = is_physical_button_pressed;
    }
}

int solo_is_locked(){
    uint64_t device_settings = ((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->device_settings;
    uint32_t tag = (uint32_t)(device_settings >> 32ull);
    return tag == ATTESTATION_CONFIGURED_TAG && (device_settings & SOLO_FLAG_LOCKED) != 0;
}

// Locks solo flash from debugging.  Locks on next reboot.
// This should be removed in next Solo release.
void solo_lock_if_not_already() {
    uint8_t buf[2048];
    memmove(buf, (uint8_t*)ATTESTATION_PAGE_ADDR, 2048);
    ((flash_attestation_page *)buf)->device_settings |= SOLO_FLAG_LOCKED;
    flash_erase_page(ATTESTATION_PAGE);
    flash_write(ATTESTATION_PAGE_ADDR, buf, 2048);
}

/** device_migrate
 * Depending on version of device, migrates:
 * * Moves attestation certificate to data segment.
 * * Creates locked variable and stores in data segment.
 *
 * Once in place, this allows all devices to accept same firmware,
 * rather than using "hacker" and "secure" builds.
*/
static void device_migrate(){
    extern const uint16_t attestation_solo_cert_der_size;
    extern const uint16_t attestation_hacker_cert_der_size;

    extern uint8_t attestation_solo_cert_der[];
    extern uint8_t attestation_hacker_cert_der[];

