planmarks/2FAK/Firmware/Non-Resident CTAP2.0-2.1/targets/stm32l432/src/device.c
    uint64_t device_settings = ((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->device_settings;
    uint32_t configure_tag = (uint32_t)(device_settings >> 32);

  /* 2FAK: respect an already-provisioned attestation page (factory-injected muru
     cert/key). Only run the migration/fallback when the page is not configured yet,
     so provisioning is not overwritten. */
  if (configure_tag != ATTESTATION_CONFIGURED_TAG)
  {
        printf1(TAG_RED,"Migrating certificate and lock information to data segment.\r\n");

        device_settings = ATTESTATION_CONFIGURED_TAG;
        device_settings <<= 32;

        // Read current device lock level.
        uint32_t optr = FLASH->OPTR;
        if ((optr & 0xff) != 0xAA){
            device_settings |= SOLO_FLAG_LOCKED;
        }

        uint8_t tmp_attestation_key[32];

        memmove(tmp_attestation_key,
            ((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->attestation_key,
            32);

        flash_erase_page(ATTESTATION_PAGE);

        // Check if this is Solo Hacker attestation (not confidential)
        // then write solo or hacker attestation cert to flash page.
        extern uint8_t solo_hacker_attestation_key[32];
        extern uint8_t solo_hacker_attestation_key_old[32];

        if (memcmp(solo_hacker_attestation_key,tmp_attestation_key,32) == 0
            || memcmp(solo_hacker_attestation_key_old, tmp_attestation_key,32) == 0)
        {
            printf1(TAG_GREEN,"Updating solo hacker cert\r\n");
            flash_write_dword(
             (uint32_t)&((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->attestation_cert_size,
             (uint64_t)attestation_hacker_cert_der_size
             );
            flash_write(
                (uint32_t)((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->attestation_cert,
                attestation_hacker_cert_der,
                attestation_hacker_cert_der_size
            );
            // for development use the currently shipped key and certificate
            flash_write(
                (uint32_t)((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->attestation_key,
                solo_hacker_attestation_key,
                32
            );
        }
        else
        {
            printf1(TAG_GREEN,"Updating solo secure cert\r\n");
            flash_write_dword(
             (uint32_t)&((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->attestation_cert_size,
             (uint64_t)attestation_solo_cert_der_size
             );
            flash_write(
                (uint32_t)((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->attestation_cert,
                attestation_solo_cert_der,
                attestation_solo_cert_der_size
            );
            flash_write(
                (uint32_t)((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->attestation_key,
                tmp_attestation_key,
                32
            );
        }

        // Save / done.
        flash_write_dword(
            (uint32_t) & ((flash_attestation_page *)ATTESTATION_PAGE_ADDR)->device_settings,
            (uint64_t)device_settings);
    } else {
      printf1(TAG_GREEN,"Certificate migration not required\r\n");
  }
}

void device_init()
{

    hw_init(LOW_FREQUENCY);

    if (! tsc_sensor_exists())
    {
        _NFC_status = nfc_init();
    }

    if (_NFC_status == NFC_IS_ACTIVE)
    {
        printf1(TAG_NFC, "Have NFC\r\n");
        isLowFreq = 1;
        IS_BUTTON_PRESSED = is_physical_button_pressed;
    }
    else
    {
        printf1(TAG_NFC, "Have NO NFC\r\n");
        hw_init(HIGH_FREQUENCY);
        isLowFreq = 0;
        device_init_button();
    }

    // Probe the ATECC608B before state is loaded. If present and provisioned it
    // supplies the hardware root used in crypto_load_master_secret(); otherwise it
    // stays dormant and the software master secret is used (no behaviour change).
    atecc_init();

    usbhid_init();
    ctaphid_init();
    ctap_init();

    device_migrate();

#if BOOT_TO_DFU
    flash_option_bytes_init(1);
#else
    flash_option_bytes_init(0);
#endif
}

int device_is_nfc(void)
{
    return _NFC_status;
}

void wait_for_usb_tether(void)
{
    while (USBD_OK != CDC_Transmit_FS((uint8_t*)"tethered\r\n", 10) )
        ;
    while (USBD_OK != CDC_Transmit_FS((uint8_t*)"tethered\r\n", 10) )
        ;
    delay(10);
    while (USBD_OK != CDC_Transmit_FS((uint8_t*)"tethered\r\n", 10) )
        ;
}

void usbhid_init(void)
{
    if (!isLowFreq)
    {
        init_usb();

#if DEBUG_LEVEL>1
        wait_for_usb_tether();
#endif
    }
    else
    {



    }
}



int usbhid_recv(uint8_t * msg)
{
    if (fifo_hidmsg_size())
    {
        fifo_hidmsg_take(msg);
        printf1(TAG_DUMP2,">> ");
        dump_hex1(TAG_DUMP2,msg, HID_PACKET_SIZE);
        return HID_PACKET_SIZE;
    }
    return 0;
}

#include "stm32l4xx_ll_pwr.h"
void usbhid_send(uint8_t * msg)
{
    uint32_t guard_counter = 0; // since this might be called during TIM6 IRQ call, we can't rely on time
    printf1(TAG_DUMP2,"<< ");
    dump_hex1(TAG_DUMP2, msg, HID_PACKET_SIZE);
    while (PCD_GET_EP_TX_STATUS(USB, HID_EPIN_ADDR & 0x0f) == USB_EP_TX_VALID){
        if(guard_counter++ >= 1000*100*2){
            // TODO replace with watchdog / issue reboot
            printf2(TAG_ERR, "Failed to send USBHID message. Discarding.\r\n");
            return;
        }
    }
    USBD_LL_Transmit(&Solo_USBD_Device, HID_EPIN_ADDR, msg, HID_PACKET_SIZE);


}

void ctaphid_write_block(uint8_t * data)
{
    usbhid_send(data);
}


void usbhid_close(void)
{

}

void main_loop_delay(void)
{

}

#ifdef LED_WINK_VALUE
static int wink_time = 0;
static uint32_t winkt1 = 0;
static uint32_t winkt2 = 0;
#endif

#include "bsp.h"
void device_wink(void)
{
    led_blink(10, LED_BLINK_PERIOD);
}

void heartbeat(void)
{
#ifdef HEARTBEAT

    static int state = 0;
    static uint32_t val = (LED_MAX_SCALER - LED_MIN_SCALER)/2;
    uint8_t r = (LED_INIT_VALUE >> 16) & 0xff;
    uint8_t g = (LED_INIT_VALUE >> 8) & 0xff;
    uint8_t b = (LED_INIT_VALUE >> 0) & 0xff;
    int but = IS_BUTTON_PRESSED_RAW();
/*
    if (state)
    {
        val--;
    }
    else
    {
        val++;
    }

    if (val >= LED_MAX_SCALER || val <= LED_MIN_SCALER)
    {
        state = !state;

		if (val > LED_MAX_SCALER)
			val = LED_MAX_SCALER;
		if (val < LED_MIN_SCALER)
			val = LED_MIN_SCALER;
    }
    */

