planmarks/2FAK/Firmware/Non-Resident CTAP2.0-2.1/targets/stm32l432/src/device.c
#include "user_feedback.h"

int ctap_user_presence_test_feedback(uint32_t up_delay, int8_t(*feedback_function)());

int ctap_user_presence_test(uint32_t up_delay){
  return ctap_user_presence_test_feedback(up_delay, u2f_get_user_feedback);
}

int ctap_user_presence_test_reset(uint32_t up_delay){
  led_set_default_color(LED_COLOR_DATA_DELETION);
  const int res = ctap_user_presence_test_feedback(up_delay, u2f_get_user_feedback_extended_wipe);
  led_reset_default_color();
  return res;
}

int ctap_user_presence_test_config(uint32_t up_delay){
  led_set_default_color(LED_COLOR_SYSTEM);
  const int res = ctap_user_presence_test_feedback(up_delay, u2f_get_user_feedback_extended_wipe);
  led_reset_default_color();
  return res;
}

typedef struct NK_timer_t {
    uint32_t wait_until_t;
} NK_timer_t;
NK_timer_t timer_wait_for(const uint32_t delay){
    NK_timer_t t;
    t.wait_until_t = millis() + delay;
    // timer overflow check, e.g. bool overflow = t.wait_until_t < millis()
    // not needed since clock will overflow as well, and will work with this method
    return t;
}

bool timer_is_elapsed(const NK_timer_t t){
    return millis() >= t.wait_until_t;
}
bool timer_is_active(const NK_timer_t t){
    return millis() < t.wait_until_t;
}

int ctap_user_presence_test_feedback(uint32_t up_delay, int8_t(*feedback_function)()){
    int ret;

    if (device_is_nfc() == NFC_IS_ACTIVE) return 1;
    if (_up_disabled) return 2;

#if SKIP_BUTTON_CHECK_WITH_DELAY
    int i=500;
    while(i--)
    {
        delay(1);
        ret = handle_packets();
        if (ret) return ret;
    }
    return 1;
#elif SKIP_BUTTON_CHECK_FAST
    delay(2);
    ret = handle_packets();
    if (ret)
        return ret;
    return 1;
#endif

    set_button_awaiting_up(true);
    printf1(TAG_BUTTON, "Waiting for user's feedback for %d ms\n", up_delay);
    NK_timer_t t = timer_wait_for(up_delay);
    while (timer_is_active(t)){
        if (feedback_function() == 0) {
            printf1(TAG_BUTTON, "User's feedback received\n");
            set_button_awaiting_up(false);
            return 1;
        }
        ret = handle_packets();
        if (ret) {
            stop_blinking();
            set_button_awaiting_up(false);
            return ret;
        }
        run_drivers();
        delay(1);
    }
    printf1(TAG_BUTTON, "User's feedback NOT received\n");
    stop_blinking();
    set_button_awaiting_up(false);
    return 0;
}

int _ctap_user_presence_test()
{
    uint16_t up_delay = 2000;
    run_drivers();
    // FIXME replace with U2F FIDO code
    int ret;

    if (device_is_nfc() == NFC_IS_ACTIVE)
    {
        return 1;
    }

    if (_up_disabled)
    {
        return 2;
    }

#if SKIP_BUTTON_CHECK_WITH_DELAY
    int i=500;
    while(i--)
    {
        delay(1);
        ret = handle_packets();
        if (ret) return ret;
    }
    goto done;
#elif SKIP_BUTTON_CHECK_FAST
    delay(2);
    ret = handle_packets();
    if (ret)
        return ret;
    goto done;
#endif

    // If button was pressed within last [2] seconds, succeed.
    if (__last_button_press_time && (millis() - __last_button_press_time < 2000))
    {
        goto done;
    }

    // Set LED status and wait.
//    led_rgb(0xff3520);
    // Block and wait for some time.
    run_drivers();
    ret = wait_for_button_activate(up_delay);
    if (ret) return ret;
    ret = wait_for_button_release(up_delay);
    if (ret) return ret;

    // If button was pressed within last [2] seconds, succeed.
    if (__last_button_press_time && (millis() - __last_button_press_time < 2000))
    {
        goto done;
    }


    return 0;


done:
    ret = wait_for_button_release(up_delay);
    __last_button_press_time = 0;
    return 1;

}

int ctap_generate_rng(uint8_t * dst, size_t num)
{
    rng_get_bytes(dst, num);
    return 1;
}


void ctap_reset_rk(void)
{
    int i;
    printf1(TAG_GREEN, "resetting RK \r\n");
    for(i = 0; i < RK_NUM_PAGES; i++)
    {
        flash_erase_page(RK_START_PAGE + i);
    }
}

uint32_t ctap_rk_size(void)
{
    return RK_NUM_PAGES * (PAGE_SIZE / sizeof(CTAP_residentKey));
}

void ctap_store_rk(int index,CTAP_residentKey * rk)
{
    ctap_overwrite_rk(index, rk);
}

void ctap_delete_rk(int index)
{
    CTAP_residentKey rk;
    memset(&rk, 0xff, sizeof(CTAP_residentKey));
    ctap_overwrite_rk(index, &rk);
}

void ctap_load_rk(int index,CTAP_residentKey * rk)
{
    int byte_offset_into_page = (sizeof(CTAP_residentKey) * (index % (PAGE_SIZE/sizeof(CTAP_residentKey))));
    int page_offset = (index)/(PAGE_SIZE/sizeof(CTAP_residentKey));

    uint32_t addr = flash_addr(page_offset + RK_START_PAGE) + byte_offset_into_page;

    printf1(TAG_GREEN, "reading RK %d @ %04x\r\n", index, addr);
    if (page_offset < RK_NUM_PAGES)
    {
        uint32_t * ptr = (uint32_t *)addr;
        memmove((uint8_t*)rk,ptr,sizeof(CTAP_residentKey));
    }
    else
    {
        printf2(TAG_ERR,"Out of bounds reading index %d for rk\n", index);
    }
}

void ctap_overwrite_rk(int index,CTAP_residentKey * rk)
{
    uint8_t tmppage[PAGE_SIZE];

    int byte_offset_into_page = (sizeof(CTAP_residentKey) * (index % (PAGE_SIZE/sizeof(CTAP_residentKey))));
    int page_offset = (index)/(PAGE_SIZE/sizeof(CTAP_residentKey));

    printf1(TAG_GREEN, "overwriting RK %d @ page %d @ addr 0x%08x-0x%08x\r\n",
        index, RK_START_PAGE + page_offset,
        flash_addr(RK_START_PAGE + page_offset) + byte_offset_into_page,
        flash_addr(RK_START_PAGE + page_offset) + byte_offset_into_page + sizeof(CTAP_residentKey)
        );
    if (page_offset < RK_NUM_PAGES)
    {
        memmove(tmppage, (uint8_t*)flash_addr(RK_START_PAGE + page_offset), PAGE_SIZE);

        memmove(tmppage + byte_offset_into_page, rk, sizeof(CTAP_residentKey));
        flash_erase_page(RK_START_PAGE + page_offset);
        flash_write(flash_addr(RK_START_PAGE + page_offset), tmppage, PAGE_SIZE);
    }
    else
    {
        printf2(TAG_ERR,"Out of bounds reading index %d for rk\n", index);
    }
    printf1(TAG_GREEN, "4\r\n");
}

void boot_st_bootloader(void)
{
    __disable_irq();

    __set_MSP(*((uint32_t *)0x1fff0000));

    ((void (*)(void)) (*((uint32_t *)0x1fff0004)))();

    while(1)
    ;
}

void boot_solo_bootloader(void)
{
    LL_IWDG_Enable(IWDG);

    LL_IWDG_EnableWriteAccess(IWDG);

    LL_IWDG_SetPrescaler(IWDG, LL_IWDG_PRESCALER_4);

    LL_IWDG_SetWindow(IWDG, 4095);

    LL_IWDG_SetReloadCounter(IWDG, 2000); // ~0.25s

    while (LL_IWDG_IsReady(IWDG) != 1)
    {
    }

    LL_IWDG_ReloadCounter(IWDG);

}

extern const uint8_t global_aaguid[16];

void device_read_aaguid(uint8_t * dst){
    memmove(dst, global_aaguid, 16);
    printf2(TAG_GREEN, "Sending AAGUID: ");
    dump_hex1(TAG_GREEN,dst, 16);
}


void _Error_Handler(char *file, int line)
{
    printf2(TAG_ERR,"Error: %s: %d\r\n", file, line);
    while(1)
    {
    }
}
